POS/app/Http/Livewire/ShowPage.php

    public function render()
    {
        if ($this->producto) {
            return view('livewire.mostrar', ['productoMostrar' => $this->producto]);
        }

        // Evitar error si no hay tablas al inicio
        $categories = collect();
        if (\Illuminate\Support\Facades\Schema::hasTable('categories')) {
            $categories = Categories::orderBy('name', 'asc')->get();
        }

        if (\Illuminate\Support\Facades\Schema::hasTable('productos')) {
            $productos = Producto::query();

            if ($this->search) {
                $productos->where('nombre', 'like', "%{$this->search}%");
            }

            if ($this->category) {
                $productos->where('categories_id', $this->category);
            }

            $productos = $productos->with('categoria')->latest()->paginate(6);
---
select * from "categories" order by "name" asc
select * from "categories" where "categories"."id" in (1)
select * from "productos" where "productos"."deleted_at" is null order by "created_at" desc limit 6 offset 0
select count(*) as aggregate from "productos" where "productos"."deleted_at" is null