POS/app/Http/Controllers/CategoriaController.php

select * from "categories" order by "id" desc limit 10 offset 0
select count(*) as aggregate from "categories"
---
    public function index()
    {
        // Ordenamos por ID descendente para ver las nuevas primero
        $categorias = Categories::orderBy('id', 'desc')->paginate(10);

insert into "categories" ("name", "color", "updated_at", "created_at") values ('motor', '#E83D38', '2026-02-10 21:00:38', '2026-02-10 21:00:38')
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:45|regex:/^[a-zA-Z\s]+$/',
        ]);

        Categories::create([
            'name' => $request->name,
            'color' => sprintf('#%06X', mt_rand(0, 0xFFFFFF)),
        ]);

select * from "categories" where "categories"."id" = '1' limit 1
delete from "categories" where "id" = 1
---
    public function destroy($id)
    {
        $categoria = Categories::findOrFail($id);

        // OPCIONAL: Validar si la categoría tiene productos antes de borrar
        // if ($categoria->productos()->count() > 0) {
        //     return back()->with('error', 'No puedes eliminar una categoría que tiene productos asociados.');
        // }

        $categoria->delete();