POS/app/Http/Controllers/CotizacionController.php

select * from "users" where "users"."id" in (1) and "users"."deleted_at" is null
---
    public function index()
    {
        // USAR get(), NO paginate()
        // DataTables se encargará de dividir las páginas automáticamente en la vista
        $cotizaciones = Cotizacion::with('user')->orderBy('created_at', 'desc')->get();

select * from "productos" where "productos"."id" in (1)
---
    public function convertirVenta($id)
    {
        try {
            DB::transaction(function () use ($id) {
                // 1. Cargar la cotización y sus productos (incluso eliminados para validar)
                $cotizacion = Cotizacion::with(['detalles.producto' => function ($query) {
                    $query->withTrashed();
                }])->findOrFail($id);

select * from "users" where "email" = 'hjerde@example.com' and "users"."deleted_at" is null limit 1
---
                // --- 4. PREPARAR USUARIOS ---

                // CLIENTE: Buscamos por email (dueño de la cotización)
                $cliente = \App\Models\User::where('email', $cotizacion->cliente_email)->first();

insert into "pedidos" ("subtotal", "impuesto", "total", "fechapedido", "estado", "user_id", "vendedor_id", "updated_at", "created_at") values (1000, 0, 1000, '2026-02-10 20:57:20', 'Nuevo', 2, 1, '2026-02-10 20:57:20', '2026-02-10 20:57:20')
insert into "detalles" ("pedido_id", "producto_id", "cantidad", "precio", "importe") values (4, 1, 1, 1000, 1000)
update "productos" set "disponible" = "disponible" - 1, "updated_at" = '2026-02-10 20:57:20' where "id" = 1
---


                // 5. Crear el PEDIDO (Venta)
                $pedido = Pedido::create([
                    'subtotal'    => $cotizacion->subtotal,
                    'impuesto'    => $cotizacion->impuesto,
                    'total'       => $cotizacion->total,
                    'fechapedido' => Carbon::now(),
                    'estado'      => 'Nuevo',

                    'user_id'     => $clienteId,  // El cliente que compra
                    'vendedor_id' => $vendedorId, // El empleado que vende (NUEVO)
                ]);

                // 6. Mover detalles y descontar stock
                foreach ($cotizacion->detalles as $detalle) {
                    Detalle::create([
                        'pedido_id'   => $pedido->id,
                        'producto_id' => $detalle->producto_id,
                        'cantidad'    => $detalle->cantidad,
                        'precio'      => $detalle->precio,
                        'importe'     => $detalle->importe
                    ]);

                    $detalle->producto->decrement('disponible', $detalle->cantidad);