POS/app/Http/Controllers/PedidoController.php

    public function index()
    {
        // OPTIMIZACIÓN: Cargamos la relación 'user' y 'vendedor' INCLUYENDO ELIMINADOS
        // y ordenamos por ID para asegurar que las últimas ventas salgan primero (más fiable que updated_at)
        $pedidos = Pedido::with([
            'user' => function($q) { $q->withTrashed(); },
            'vendedor' => function($q) { $q->withTrashed(); }
        ])->orderByDesc("id")->get();
---
select * from "pedidos" order by "id" desc
select * from "users" where "users"."id" in (2, 3, 5)