POS/app/Http/Controllers/ProductosController.php

select * from "productos" where "productos"."id" = '1' and "productos"."deleted_at" is null limit 1
select * from "categories" order by "name" asc
---
    public function edit($id)
    {
        $producto = Producto::findOrFail($id);
        $categorias = Categories::orderBy('name')->get();