POS/app/Http/Controllers/UserController.php

select * from "users" where "users"."deleted_at" is null
---
    public function index()
    {
        // Obtenemos todos los usuarios excepto el actual para evitar auto-eliminación accidental, o todos.
        $users = User::with('roles')->get();