POS/app/Http/Middleware/CheckAppActivation.php

select * from "app_settings" where "key" = 'app_activated' limit 1
---
    private function isActivated(): bool
    {
        try {
            // Verificar si la tabla existe
            if (!Schema::hasTable('app_settings')) {
                return false;
            }

            $setting = DB::table('app_settings')
                ->where('key', 'app_activated')
                ->first();