POS/app/Http/Livewire/Admin/Cotizaciones/CrearCotizacion.php

select * from "users" where "email" = 'hjerde@example.com' and "users"."deleted_at" is null limit 1
---
    public function mount($cotizacionId = null)
    {
        $this->fecha = Carbon::now()->format('d/m/Y');

        // 1. TRUCO DE SEGURIDAD:
        // Si Livewire no pasó el argumento, lo forzamos leyendo la ruta URL.
        if (!$cotizacionId) {
            $cotizacionId = request()->route('cotizacionId');
        }

        // 2. Si detectamos un ID, activamos el modo edición
        if ($cotizacionId) {
            $cotizacion = Cotizacion::find($cotizacionId);

            if ($cotizacion) {
                $this->cotizacionEdicionId = $cotizacion->id;
                $this->modoEdicion = true; // ¡IMPORTANTE!

                // Cargar cliente para el buscador
                $clienteUser = User::where('email', $cotizacion->cliente_email)->first();

select * from "productos" where "productos"."id" = 1 and "productos"."deleted_at" is null limit 1
---
                $detalles = DetalleCotizacion::where('cotizacion_id', $cotizacion->id)->get();

                foreach ($detalles as $detalle) {
                    $prod = Producto::find($detalle->producto_id);

select * from "users" where ("name" like '%mose%' or "email" like '%mose%') and "users"."deleted_at" is null limit 5
---
    public function updatedBuscarCliente()
    {
        if (strlen($this->buscarCliente) == 0) {
            $this->resultadosClientes = [];
            $this->cliente_id = "";
            return;
        }

        $this->resultadosClientes = User::where('name', 'like', '%' . $this->buscarCliente . '%')
            ->orWhere('email', 'like', '%' . $this->buscarCliente . '%')
            ->take(5)
            ->get();

select * from "users" where "users"."id" = 3 and "users"."deleted_at" is null limit 1
---
    public function seleccionarCliente($id)
    {
        $cliente = User::find($id);

select * from "productos" where "productos"."id" = 1 and "productos"."deleted_at" is null limit 1
---
    public function seleccionarProducto($id)
    {
        $producto = Producto::find($id);

select * from "users" where "users"."id" = 3 and "users"."deleted_at" is null limit 1
---
    public function guardarCotizacion()
    {
        $this->validate([
            'cliente_id' => 'required',
            'items' => 'required|array|min:1'
        ]);

        DB::transaction(function () {
            $cliente = User::find($this->cliente_id);

            // Verificamos el modo edición AQUÍ
            if ($this->modoEdicion && $this->cotizacionEdicionId) {
                // ACTUALIZAR
                $cotizacion = Cotizacion::find($this->cotizacionEdicionId);
                $cotizacion->update([
                    'cliente_nombre' => $cliente->name,
                    'cliente_email' => $cliente->email,
                    'subtotal' => $this->subtotal,
                    'impuesto' => $this->iva,
                    'total' => $this->total,
                ]);
                // Borramos detalles viejos
                DetalleCotizacion::where('cotizacion_id', $cotizacion->id)->delete();
                $this->cotizacionGuardadaId = $cotizacion->id;
            } else {
                // CREAR NUEVA
                $cotizacion = Cotizacion::create([
                    'user_id' => auth()->id(),

select * from "users" where "users"."deleted_at" is null
---
    public function render()
    {
        return view('livewire.admin.cotizaciones.crear-cotizacion', [
            'clientes' => \App\Models\User::all(),
        ])
            ->extends('adminlte::page')
            ->section('content');